# 算术运算符
# 赋值运算符
# 复合赋值运算符
# 比较运算符
# 逻辑运算符

# 算术运算符
# +     加          1 + 1 输出结果为2
# -     减          1 - 1 输出结果为0
# *     乘          2 * 2 输出结果为4
# /     除          10 / 2 输出结果为5
# //    整除        9 // 4 输出结果为2
# %     取余        9 % 4 输出结果为1
# **    指数        2 ** 4 输出结果为16.即 2 * 2 * 2 * 2
# ()    小括号      小括号用来提高运算优先等级，即(1 + 2) * 3 输出结果为9
# 注意：混合运算优先级顺序：() 高于 ** 高于 * / // % 高于 + -

num1 = 1 + 1 # 2
num2 = 1 + 1.1 # 2.1
num3 = 2 * 0.5 # 1.0
num4 = 4 / 2 # 2.0 除法结果都是浮点类型
num5 = 2 * 3 ** 2 # 18
num6 = (2 * 3) ** 2 # 36
print(num1, num2, num3, num4, num5, num6)
