# 复合赋值运算符
# +=        加法赋值运算符      c += a 等价于 c = c + a
# -=        减法赋值运算符      c -= a 等价于 c = c - a
# *=        乘法赋值运算符      c *= a 等价于 c = c * a
# /=        除法赋值运算符      c /= a 等价于 c = c / a
# //=       整除赋值运算符      c //= a 等价于 c = c // a
# %=        取余赋值运算符      c %= a 等价于 c = c % a
# **=       幂赋值运算符        c **= a 等价于 c = c ** a

num = 10
print(f'num: {num}')
num += 1
print(f'num += 1: {num}')

# 优先级
# 1.先算复合赋值运算符右侧的表达式
# 2.再算复合赋值运算的算数运算
# 3.最后算赋值运算

num1 = 10
num1 *= 2 + 2 # 40
print(num1)
